In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
#Create a Series (Learn how to handle missing value in Series)
data = Series(['one','four',np.nan,'two'])

In [4]:
data

0     one
1    four
2     NaN
3     two
dtype: object

In [5]:
#To check which one is missing

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
#drop missing value
data.dropna()

0     one
1    four
3     two
dtype: object

In [8]:
#Handle missing value in dataframe

In [10]:
# create a dataframe (notice: it is DataFrame() not DataFrame[])
df = pd.DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [11]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [12]:
df. dropna() #drop the entire row contains nan

     0    1    2
0  1.0  2.0  3.0

In [13]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [14]:
df.dropna(how = 'all') #dropna is for drop rows

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [15]:
df.dropna (axis = 1) #drop columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
df2 = pd.DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,8],[9,np.nan,np.nan,np.nan]])

In [19]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  8.0
3  9.0  NaN  NaN  NaN

In [20]:
df2.dropna(thresh=2) #at least 2 elements are not nan

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  8.0

In [21]:
df2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [22]:
df #drop function won't modify the original df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [23]:
df2.dropna(thresh=3, inplace = True) #inplace parameter = true will modify the original df2

In [24]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [25]:
#replace missing value

In [27]:
df2 = pd.DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,8],[9,np.nan,np.nan,np.nan]])

In [28]:
df2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  8.0
3  9.0  1.0  1.0  1.0

In [29]:
#fill null to specific column with specific value by passing dictionary

In [30]:
df2.fillna({0:0,1:1,2:2,3:3})#column0 fill with 0, column1 fill with 1

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  8.0
3  9.0  1.0  2.0  3.0